-- MySQL dump 10.13  Distrib 8.0.27, for Win64 (x86_64)
--
-- Host: localhost    Database: jpncards
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cards`
--

DROP TABLE IF EXISTS `cards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cards` (
  `id` int NOT NULL AUTO_INCREMENT,
  `inJapan` varchar(128) NOT NULL,
  `inRussian` varchar(128) NOT NULL,
  `mark` int NOT NULL,
  `dateAdd` date DEFAULT NULL,
  `userId` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=213 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cards`
--

LOCK TABLES `cards` WRITE;
/*!40000 ALTER TABLE `cards` DISABLE KEYS */;
INSERT INTO `cards` VALUES (4,'こんいちわ',' Здравствуйте                                ',0,'2022-05-20',49),(5,'にほんご',' Японский язык                               ',0,'2022-05-20',49),(6,'りんご',' Яблоко                                      ',0,'2022-05-20',49),(7,'すみません',' прошу прощения                              ',0,'2022-05-20',49),(8,'はじめまして',' Приятно познакомиться                       ',0,'2022-05-20',49),(9,'せんせい',' Учитель                                     ',0,'2022-05-20',49),(10,'おはよう',' Доброе утро                                 ',0,'2022-05-20',49),(11,'なまえ',' Имя                                         ',0,'2022-05-20',49),(12,'こ',' Ребенок                                     ',0,'2022-05-20',49),(13,'いるか',' Дельфин                                     ',0,'2022-05-20',49),(14,'てんき',' Электричество                               ',0,'2022-05-20',49),(15,'だいがく',' Университет                                 ',0,'2022-05-20',49),(16,'げつ',' Месяц                                       ',0,'2022-05-20',49),(17,'に',' День                                        ',0,'2022-05-20',49),(18,'わたし',' Я                                           ',0,'2022-05-20',49),(19,'わたしたち',' Мы                                          ',0,'2022-05-20',49),(20,'あなた',' Ты                                          ',0,'2022-05-20',49),(21,'あのひと',' Он, она                                     ',0,'2022-05-20',49),(22,'きょうし',' Преподаватель                               ',0,'2022-05-20',49),(23,'がくせい',' Студент                                     ',0,'2022-05-20',49),(24,'かいしゃいん',' Сотрудник компании                          ',0,'2022-05-20',49),(25,'しゃいん',' Сотрудник конкретной компании               ',0,'2022-05-20',49),(26,'ぎんこういん',' Сотрудник банка                             ',0,'2022-05-20',49),(27,'いしゃ',' Врач                                        ',0,'2022-05-20',49),(28,'けんきょうしゃ',' Ученый                                      ',0,'2022-05-20',49),(29,'びょいん',' Больница                                    ',0,'2022-05-20',49),(30,'だれ',' Кто                                         ',0,'2022-05-20',49),(31,'ーさい',' -лет(возраст)                               ',0,'2022-05-20',49),(32,'なんさい / おいくつ',' Сколько лет                                 ',0,'2022-05-20',49),(33,'ーからきました',' Приехал из                                  ',0,'2022-05-20',49),(34,'き',' Дерево                                      ',0,'2022-05-21',49),(35,'しつれいですが',' Извините                                    ',0,'2022-05-22',49),(36,'ほん',' Книга                                       ',0,'2022-05-22',49),(37,'じしょ',' Словарь                                     ',0,'2022-05-22',49),(38,'ざっし',' Журнал                                      ',0,'2022-05-22',49),(39,'しんぶん',' Газета                                      ',0,'2022-05-22',49),(40,'ノート',' Тетрадь                                     ',0,'2022-05-22',49),(42,'てちょう',' Блокнот                                     ',0,'2022-05-22',49),(43,'めいし',' Визитная карточка                           ',0,'2022-05-22',49),(44,'カード',' Карта                                       ',0,'2022-05-22',49),(45,'テレホンカード',' Телефонная карточка                         ',0,'2022-05-22',49),(46,'えんぴつ',' Карандаш                                    ',0,'2022-05-22',49),(48,'ボールペン',' Шариковая ручка                             ',0,'2022-05-22',49),(49,'シャープペンシル',' Автоматический карандаш                     ',0,'2022-05-22',49),(50,'かぎ',' Ключ                                        ',0,'2022-05-22',49),(51,'とけい',' Часы                                        ',0,'2022-05-22',49),(52,'かさ',' Зонт                                        ',0,'2022-05-22',49),(53,'かばん',' Сумка                                       ',0,'2022-05-22',49),(54,'テープ',' Лента                                       ',0,'2022-05-22',49),(55,'テープレコーダー',' Магнитофон                                  ',0,'2022-05-22',49),(56,'テリビ',' Телевизор                                   ',0,'2022-05-22',49),(57,'ラジオ',' Радио                                       ',0,'2022-05-22',49),(58,'カメラ',' Фотоаппарат                                 ',0,'2022-05-22',49),(59,'コンピューター',' Компьютер                                   ',0,'2022-05-22',49),(60,'じどうしゃ',' Автомобиль                                  ',0,'2022-05-22',49),(61,'つくえ',' Стол                                        ',0,'2022-05-22',49),(62,'いす',' Стул                                        ',0,'2022-05-22',49),(63,'コーヒー',' Кофе                                        ',0,'2022-05-22',49),(64,'チョコレット',' Шоколад                                     ',0,'2022-05-22',49),(65,'えいご',' Английский язык                             ',0,'2022-05-22',49),(66,'なん',' Что                                         ',0,'2022-05-22',49),(67,'ちがいます',' Нет, не так./Неправильно                    ',0,'2022-05-22',49),(68,'そうですか',' Вот как?/Правда?                            ',0,'2022-05-22',49),(69,'ほんのきもちです',' От души, не стоит благодарности             ',0,'2022-05-22',49),(70,'どうぞ',' Вот, пожалуйста (при предложении чего либо) ',0,'2022-05-22',49),(71,'どうも',' Спасибо                                     ',0,'2022-05-22',49),(72,'これからおせわになります',' Буду надеятся на вашу помощь                ',0,'2022-05-22',49),(84,'ここ',' Здесь                                       ',0,'2022-05-23',49),(85,'そこ',' Там                                         ',0,'2022-05-23',49),(86,'あそこ',' Там (далеко)                                ',0,'2022-05-23',49),(87,'どこ',' Где?                                        ',0,'2022-05-23',49),(88,'きょうしつ',' Класс, аудитория                            ',0,'2022-05-23',49),(89,'しょくどう',' Столовая                                    ',0,'2022-05-23',49),(90,'じむしょ',' Офис                                        ',0,'2022-05-23',49),(91,'かいぎしつ',' Зал заседаний                               ',0,'2022-05-23',49),(92,'うけつけ',' Приемная, стойка администратора             ',0,'2022-05-23',49),(93,'ロビー',' Вестибюль                                   ',0,'2022-05-23',49),(94,'へや',' Комната                                     ',0,'2022-05-23',49),(95,'トイレ',' Туалет                                      ',0,'2022-05-23',49),(96,'おてあらい',' Туалет                                      ',0,'2022-05-23',49),(97,'かいだん',' Лестница                                    ',0,'2022-05-23',49),(98,'エレベーター',' Лифт                                        ',0,'2022-05-23',49),(99,'エスカレーター',' Эскалатор                                   ',0,'2022-05-23',49),(100,'くに',' Страна                                      ',0,'2022-05-23',49),(101,'かいしゃ',' Компания                                    ',0,'2022-05-23',49),(102,'うち',' Дом                                         ',0,'2022-05-23',49),(103,'でんわ',' Телефон                                     ',0,'2022-05-23',49),(104,'くつ',' Обувь                                       ',0,'2022-05-23',49),(105,'ネクタイ',' Галстук                                     ',0,'2022-05-23',49),(106,'ワイン',' Вино                                        ',0,'2022-05-23',49),(107,'たばこ',' Табак, сигареты                             ',0,'2022-05-23',49),(108,'うりば',' Отдел, прилавок в магазине                  ',0,'2022-05-23',49),(109,'ちか',' Подвал                                      ',0,'2022-05-23',49),(110,'ーかい',' Этаж                                        ',0,'2022-05-23',49),(111,'いくら',' Сколько стоит?                              ',0,'2022-05-23',49),(112,'ください',' Пожалуйста (дайте)                          ',0,'2022-05-23',49),(117,'ちさい',' Маленький                                   ',0,'2022-05-27',49),(119,'qwe',' qwe                                         ',0,'2022-05-27',49),(120,'おきます',' Просыпаться, вставать                       ',0,'2022-05-29',49),(121,'ねます',' (идти) спать                                ',0,'2022-05-29',49),(122,'はたらきます',' Работать                                    ',0,'2022-05-29',49),(123,'やすみます',' Отдыхать                                    ',0,'2022-05-29',49),(124,'べんきょうします',' Учиться                                     ',0,'2022-05-29',49),(125,'おわります',' Заканчивать                                 ',0,'2022-05-29',49),(126,'デパート',' Универмаг                                   ',0,'2022-05-29',49),(127,'ぎんこう',' Банк                                        ',0,'2022-05-29',49),(128,'ゆうびんきょく',' Почта                                       ',0,'2022-05-29',49),(129,'としょかん',' Библиотека                                  ',0,'2022-05-29',49),(130,'びじゅつかん',' Музей                                       ',0,'2022-05-29',49),(131,'いま',' Сейчас                                      ',0,'2022-05-29',49),(132,'-じ',' Часов                                       ',0,'2022-05-29',49),(133,'ーふん',' Минут                                       ',0,'2022-05-29',49),(134,'はん',' Половина                                    ',0,'2022-05-29',49),(135,'なんじ',' Сколько времени?                            ',0,'2022-05-29',49),(136,'なんぷん',' Сколько минут?                              ',0,'2022-05-29',49),(137,'ごぜん',' Первая половина дня                         ',0,'2022-05-29',49),(138,'あさ',' Утро                                        ',0,'2022-05-29',49),(139,'ひる',' Середина дня                                ',0,'2022-05-29',49),(140,'おととい',' Позавчера                                   ',0,'2022-05-29',49),(141,'きのう',' Вчера                                       ',0,'2022-05-29',49),(142,'きょう',' Сегодня                                     ',0,'2022-05-29',49),(143,'あした',' Завтра                                      ',0,'2022-05-29',49),(144,'あさって',' Послезавтра                                 ',0,'2022-05-29',49),(145,'けさ',' Сегодня утром                               ',0,'2022-05-29',49),(146,'こんばん',' Сегодня вечером                             ',0,'2022-05-29',49),(147,'やすみ',' Выходной, праздник                          ',0,'2022-05-29',49),(148,'ひるやすみ',' Обеденный перерыв                           ',0,'2022-05-29',49),(149,'まいあさ',' Каждое утро                                 ',0,'2022-05-29',49),(150,'まいばん',' Каждый вечер                                ',0,'2022-05-29',49),(151,'まいにち',' Каждый день                                 ',0,'2022-05-29',49),(152,'げつようび',' Понедельник                                 ',0,'2022-05-29',49),(153,'かようび',' Вторник                                     ',0,'2022-05-29',49),(154,'すいようび',' Среда                                       ',0,'2022-05-29',49),(155,'もくようび',' Четверг                                     ',0,'2022-05-29',49),(156,'きんようび',' Пятница                                     ',0,'2022-05-29',49),(157,'どようび',' Суббота                                     ',0,'2022-05-29',49),(158,'にちようび',' Воскресение                                 ',0,'2022-05-29',49),(159,'なんようび',' Какой день недели?                          ',0,'2022-05-29',49),(160,'ばんごう',' Номер                                       ',0,'2022-05-29',49),(161,'なんばん',' Какой номер?                                ',0,'2022-05-29',49),(162,'ーから',' с                                           ',0,'2022-05-29',49),(163,'ーまで',' По                                          ',0,'2022-05-29',49),(164,'と',' И                                           ',0,'2022-05-29',49),(165,'そちら',' У вас(тут)                                  ',0,'2022-05-29',49),(166,'いきます',' Идти                                        ',0,'2022-06-01',49),(167,'きます',' Приходить                                   ',0,'2022-06-01',49),(168,'かえります',' Возвращаться                                ',0,'2022-06-01',49),(169,'がっこう',' Школа                                       ',0,'2022-06-01',49),(170,'スーパー',' Супермаркет                                 ',0,'2022-06-01',49),(171,'えき',' Станция                                     ',0,'2022-06-01',49),(172,'ひこうき',' Самолет                                     ',0,'2022-06-01',49),(173,'ふね',' Корабль                                     ',0,'2022-06-01',49),(174,'でんしゃ',' Поезд                                       ',0,'2022-06-01',49),(175,'ちかてつ',' Метро                                       ',0,'2022-06-01',49),(177,'タクシー',' Такси                                       ',0,'2022-06-01',49),(178,'じてんしゃ',' Велосипед                                   ',0,'2022-06-01',49),(179,'あるいて',' Пешком                                      ',0,'2022-06-01',49),(180,'ひと',' Человек                                     ',0,'2022-06-01',49),(181,'ともだち',' Друг                                        ',0,'2022-06-01',49),(183,'かれ',' Друг (мужского пола)                        ',0,'2022-06-01',49),(184,'バス',' Автобус                                     ',0,'2022-06-01',49),(185,'かのじょ',' Подруга                                     ',0,'2022-06-01',49),(186,'かぞく',' Семья                                       ',0,'2022-06-01',49),(187,'ひとりで',' Один                                        ',0,'2022-06-01',49),(188,'せんしゃう',' Прошлая неделя                              ',0,'2022-06-01',49),(189,'こんしゃう',' Эта неделя                                  ',0,'2022-06-01',49),(190,'らいしゃう',' Следующая неделя                            ',0,'2022-06-01',49),(191,'せんげつ',' Прошлый месяц                               ',0,'2022-06-01',49),(192,'こんげつ',' Этот месяц                                  ',0,'2022-06-01',49),(193,'らいげつ',' Следующий месяц                             ',0,'2022-06-01',49),(194,'きょねん',' Прошлый год                                 ',0,'2022-06-01',49),(195,'ことし',' Этот год                                    ',0,'2022-06-01',49),(196,'らいねん',' Следующий год                               ',0,'2022-06-01',49),(197,'ーがつ',' -й месяц                                    ',0,'2022-06-01',49),(198,'なんがつ',' Какой месяц?                                ',0,'2022-06-01',49),(199,'ついたち',' Первое число месяца                         ',0,'2022-06-01',49),(200,'ふつか',' Второе число месяца                         ',0,'2022-06-01',49),(202,'みっか',' Третье число месяца                         ',0,'2022-06-01',49),(203,'よっか',' 4 число месяца                              ',0,'2022-06-01',49),(204,'いつか',' 5 число месяца                              ',0,'2022-06-01',49),(205,'むいか',' 6 число месяца                              ',0,'2022-06-01',49),(206,'なのか',' 7 число месяца                              ',0,'2022-06-01',49),(207,'ようか',' 8 число месяца                              ',0,'2022-06-01',49),(208,'ここのか',' ９                                          ',0,'2022-06-01',49),(209,'とおか',' 10 число месяца                             ',0,'2022-06-01',49),(210,'じゅうよっか',' 14 число месяца                             ',0,'2022-06-01',49),(211,'なつか',' 20 дней                                     ',0,'2022-06-01',49),(212,'にじゅうよっか',' 24 число месяца                             ',0,'2022-06-01',49);
/*!40000 ALTER TABLE `cards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sessions`
--

DROP TABLE IF EXISTS `sessions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sessions` (
  `sessionId` varchar(255) NOT NULL,
  `userId` int DEFAULT NULL,
  `expires` datetime NOT NULL,
  PRIMARY KEY (`sessionId`),
  KEY `userId` (`userId`),
  CONSTRAINT `sessions_ibfk_1` FOREIGN KEY (`userId`) REFERENCES `users` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sessions`
--

LOCK TABLES `sessions` WRITE;
/*!40000 ALTER TABLE `sessions` DISABLE KEYS */;
INSERT INTO `sessions` VALUES ('aeefofriwqiioe',49,'2022-05-24 18:46:42'),('aoytaiuytwpryw',49,'2022-05-29 19:44:05'),('eesysrdaqefqrd',49,'2022-05-24 13:33:25'),('fqprydqwswauop',49,'2022-06-01 22:19:02'),('itifofdsaosyyp',49,'2022-05-26 16:07:41'),('tpaoufeqfeiiuy',49,'2022-05-26 17:22:24');
/*!40000 ALTER TABLE `sessions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `login` varchar(255) NOT NULL,
  `password` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `login` (`login`)
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (49,'aboba','qawsed345rf','aboba@qwe.com'),(51,'mob','qawsed345rf','qwe@qwe.com'),(53,'aboba2','qweqweqwe','qwe@qwe.com');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-06-02 20:53:40
